#include "Menu.h"

void Menu::IndentityMenu()	 //身份选择显示菜单
{
	cout << "********************************" << endl;
	cout << "***欢迎来到学生选修课程系统！***" << endl;
	cout << "********    1.管理员    ********" << endl;
	cout << "********    2.学生      ********" << endl;
	cout << "********    0.quit      ********" << endl;
	cout << "********************************" << endl;
	cout << "选择您的身份:请输入“1”或“2”" << endl;
}


void Menu::AdmMenu()		//管理员选择菜单
{
	cout << "***************************************" << endl;
	cout << "******    1.浏览所有信息         ******" << endl;
	cout << "******    2.查询指定信息         ******" << endl;
	cout << "******    3.添加课程             ******" << endl;
	cout << "******    4.向课程内添加学生     ******" << endl;
	cout << "******    5.修改课程或学生信息   ******" << endl;
	cout << "******    6.删除课程或课程内学生 ******" << endl;
	cout << "******    7.统计相关信息         ******" << endl;
	cout << "******    8.手动保存             ******" << endl;
	cout << "******    9.格式化(需手动保存）  ******" << endl;
	cout << "******    0.退出此系统           ******" << endl;
	cout << "***************************************" << endl;
}

void Menu::StuMenu()		//学生选择菜单
{
	cout << "********************************" << endl;
	cout << "*****  1.浏览所有课程信息  *****" << endl;
	cout << "*****  2.查询指定课程信息  *****" << endl;
	cout << "*****  3.查看已选          *****" << endl;
	cout << "*****  4.选课              *****" << endl;
	cout << "*****  5.退课              *****" << endl;
	cout << "*****  6.手动保存          *****" << endl;
	cout << "*****  0.退出此系统        *****" << endl;
	cout << "********************************" << endl;
}



